---
kind: other
id: Methods.T:Autodesk.Revit.DB.LinearArray
source: html/cad0b3a7-6367-cfe2-7b15-4368d84f2e4a.htm
---
# LinearArray Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.